bench/out/20260107_124052/producer-perf-test.log
[bench] BOOTSTRAP=my-cluster-kafka-bootstrap.kafka.svc:9092
[bench] TOPIC=test-topic NUM_RECORDS=10000000 RECORD_SIZE=10240 THROUGHPUT=10000
[bench] ACKS=all LINGER_MS=0 COMPRESSION=none
2026-01-07 03:41:01 10660 records sent, 2132.0 records/sec (20.82 MB/sec), 847.7 ms avg latency, 1607.0 ms max latency.
2026-01-07 03:41:06 21450 records sent, 4290.0 records/sec (41.89 MB/sec), 477.9 ms avg latency, 647.0 ms max latency.
2026-01-07 03:41:11 22975 records sent, 4595.0 records/sec (44.87 MB/sec), 447.8 ms avg latency, 713.0 ms max latency.
2026-01-07 03:41:16 24085 records sent, 4817.0 records/sec (47.04 MB/sec), 425.2 ms avg latency, 515.0 ms max latency.
2026-01-07 03:41:21 23999 records sent, 4799.8 records/sec (46.87 MB/sec), 421.1 ms avg latency, 524.0 ms max latency.
2026-01-07 03:41:26 21783 records sent, 4356.6 records/sec (42.54 MB/sec), 474.2 ms avg latency, 678.0 ms max latency.
2026-01-07 03:41:31 25036 records sent, 5007.2 records/sec (48.90 MB/sec), 410.5 ms avg latency, 507.0 ms max latency.
2026-01-07 03:41:36 22912 records sent, 4582.4 records/sec (44.75 MB/sec), 447.4 ms avg latency, 631.0 ms max latency.
2026-01-07 03:41:41 25202 records sent, 5040.4 records/sec (49.22 MB/sec), 406.3 ms avg latency, 457.0 ms max latency.
2026-01-07 03:41:46 24016 records sent, 4803.2 records/sec (46.91 MB/sec), 427.2 ms avg latency, 571.0 ms max latency.
2026-01-07 03:41:51 24686 records sent, 4937.2 records/sec (48.21 MB/sec), 413.8 ms avg latency, 504.0 ms max latency.
2026-01-07 03:41:56 24244 records sent, 4848.8 records/sec (47.35 MB/sec), 418.8 ms avg latency, 497.0 ms max latency.
2026-01-07 03:42:01 24117 records sent, 4823.4 records/sec (47.10 MB/sec), 429.5 ms avg latency, 661.0 ms max latency.
2026-01-07 03:42:08 7785 records sent, 1133.5 records/sec (11.07 MB/sec), 402.8 ms avg latency, 5756.0 ms max latency.
2026-01-07 03:42:13 20740 records sent, 4148.0 records/sec (40.51 MB/sec), 1020.2 ms avg latency, 6105.0 ms max latency.
2026-01-07 03:42:18 21056 records sent, 4211.2 records/sec (41.13 MB/sec), 486.4 ms avg latency, 824.0 ms max latency.
2026-01-07 03:42:23 25408 records sent, 5081.6 records/sec (49.63 MB/sec), 404.3 ms avg latency, 439.0 ms max latency.
2026-01-07 03:42:28 22906 records sent, 4580.3 records/sec (44.73 MB/sec), 447.3 ms avg latency, 606.0 ms max latency.
2026-01-07 03:42:33 25020 records sent, 5004.0 records/sec (48.87 MB/sec), 408.6 ms avg latency, 456.0 ms max latency.
2026-01-07 03:42:38 23913 records sent, 4782.6 records/sec (46.71 MB/sec), 428.7 ms avg latency, 502.0 ms max latency.
2026-01-07 03:42:43 23893 records sent, 4778.6 records/sec (46.67 MB/sec), 429.2 ms avg latency, 578.0 ms max latency.
2026-01-07 03:42:48 24257 records sent, 4850.4 records/sec (47.37 MB/sec), 422.4 ms avg latency, 505.0 ms max latency.
2026-01-07 03:42:53 25079 records sent, 5015.8 records/sec (48.98 MB/sec), 408.6 ms avg latency, 469.0 ms max latency.
2026-01-07 03:42:58 21643 records sent, 4328.6 records/sec (42.27 MB/sec), 462.0 ms avg latency, 665.0 ms max latency.
2026-01-07 03:43:03 25132 records sent, 5026.4 records/sec (49.09 MB/sec), 416.4 ms avg latency, 628.0 ms max latency.
2026-01-07 03:43:08 22722 records sent, 4544.4 records/sec (44.38 MB/sec), 450.4 ms avg latency, 652.0 ms max latency.
2026-01-07 03:43:13 25042 records sent, 5008.4 records/sec (48.91 MB/sec), 410.5 ms avg latency, 481.0 ms max latency.
2026-01-07 03:43:18 23917 records sent, 4783.4 records/sec (46.71 MB/sec), 428.5 ms avg latency, 502.0 ms max latency.
2026-01-07 03:43:23 24535 records sent, 4907.0 records/sec (47.92 MB/sec), 416.5 ms avg latency, 528.0 ms max latency.
2026-01-07 03:43:28 24274 records sent, 4854.8 records/sec (47.41 MB/sec), 422.4 ms avg latency, 494.0 ms max latency.
2026-01-07 03:43:33 23781 records sent, 4756.2 records/sec (46.45 MB/sec), 431.0 ms avg latency, 697.0 ms max latency.
2026-01-07 03:43:38 22893 records sent, 4578.6 records/sec (44.71 MB/sec), 445.5 ms avg latency, 643.0 ms max latency.
2026-01-07 03:43:43 25374 records sent, 5074.8 records/sec (49.56 MB/sec), 405.7 ms avg latency, 455.0 ms max latency.
2026-01-07 03:43:48 24078 records sent, 4815.6 records/sec (47.03 MB/sec), 425.1 ms avg latency, 493.0 ms max latency.
2026-01-07 03:43:53 24913 records sent, 4982.6 records/sec (48.66 MB/sec), 410.6 ms avg latency, 439.0 ms max latency.
2026-01-07 03:43:58 23957 records sent, 4791.4 records/sec (46.79 MB/sec), 427.5 ms avg latency, 507.0 ms max latency.
2026-01-07 03:44:03 23663 records sent, 4732.6 records/sec (46.22 MB/sec), 433.9 ms avg latency, 714.0 ms max latency.
2026-01-07 03:44:08 22575 records sent, 4515.0 records/sec (44.09 MB/sec), 450.1 ms avg latency, 696.0 ms max latency.
2026-01-07 03:44:13 25180 records sent, 5036.0 records/sec (49.18 MB/sec), 410.4 ms avg latency, 523.0 ms max latency.
2026-01-07 03:44:18 23245 records sent, 4649.0 records/sec (45.40 MB/sec), 429.4 ms avg latency, 607.0 ms max latency.
2026-01-07 03:44:23 24245 records sent, 4849.0 records/sec (47.35 MB/sec), 432.6 ms avg latency, 680.0 ms max latency.
2026-01-07 03:44:28 24499 records sent, 4899.8 records/sec (47.85 MB/sec), 417.4 ms avg latency, 472.0 ms max latency.
2026-01-07 03:44:33 23721 records sent, 4744.2 records/sec (46.33 MB/sec), 433.0 ms avg latency, 639.0 ms max latency.
2026-01-07 03:44:38 24507 records sent, 4901.4 records/sec (47.87 MB/sec), 418.4 ms avg latency, 482.0 ms max latency.
2026-01-07 03:44:43 24084 records sent, 4816.8 records/sec (47.04 MB/sec), 424.2 ms avg latency, 504.0 ms max latency.
2026-01-07 03:44:48 24540 records sent, 4908.0 records/sec (47.93 MB/sec), 418.4 ms avg latency, 477.0 ms max latency.
2026-01-07 03:44:53 24709 records sent, 4941.8 records/sec (48.26 MB/sec), 414.4 ms avg latency, 467.0 ms max latency.
2026-01-07 03:44:58 24571 records sent, 4914.2 records/sec (47.99 MB/sec), 416.7 ms avg latency, 481.0 ms max latency.
2026-01-07 03:45:03 22477 records sent, 4495.4 records/sec (43.90 MB/sec), 456.0 ms avg latency, 648.0 ms max latency.
2026-01-07 03:45:08 22865 records sent, 4573.0 records/sec (44.66 MB/sec), 446.4 ms avg latency, 677.0 ms max latency.
2026-01-07 03:45:13 25167 records sent, 5033.4 records/sec (49.15 MB/sec), 407.9 ms avg latency, 480.0 ms max latency.
2026-01-07 03:45:18 24577 records sent, 4915.4 records/sec (48.00 MB/sec), 417.2 ms avg latency, 475.0 ms max latency.
2026-01-07 03:45:23 24347 records sent, 4869.4 records/sec (47.55 MB/sec), 421.0 ms avg latency, 505.0 ms max latency.
2026-01-07 03:45:28 24395 records sent, 4879.0 records/sec (47.65 MB/sec), 420.1 ms avg latency, 489.0 ms max latency.
2026-01-07 03:45:33 24028 records sent, 4805.6 records/sec (46.93 MB/sec), 425.8 ms avg latency, 623.0 ms max latency.
2026-01-07 03:45:38 20814 records sent, 4162.8 records/sec (40.65 MB/sec), 492.6 ms avg latency, 679.0 ms max latency.
2026-01-07 03:45:43 25231 records sent, 5046.2 records/sec (49.28 MB/sec), 406.1 ms avg latency, 472.0 ms max latency.
2026-01-07 03:45:48 24289 records sent, 4857.8 records/sec (47.44 MB/sec), 420.9 ms avg latency, 515.0 ms max latency.
2026-01-07 03:45:53 25408 records sent, 5081.6 records/sec (49.63 MB/sec), 404.2 ms avg latency, 443.0 ms max latency.
2026-01-07 03:45:58 24685 records sent, 4937.0 records/sec (48.21 MB/sec), 414.6 ms avg latency, 481.0 ms max latency.
2026-01-07 03:46:03 23126 records sent, 4625.2 records/sec (45.17 MB/sec), 442.2 ms avg latency, 640.0 ms max latency.
2026-01-07 03:46:08 19552 records sent, 3910.4 records/sec (38.19 MB/sec), 503.1 ms avg latency, 847.0 ms max latency.
2026-01-07 03:46:13 21870 records sent, 4374.0 records/sec (42.71 MB/sec), 487.8 ms avg latency, 853.0 ms max latency.
2026-01-07 03:46:18 24089 records sent, 4817.8 records/sec (47.05 MB/sec), 425.8 ms avg latency, 551.0 ms max latency.
2026-01-07 03:46:23 24882 records sent, 4976.4 records/sec (48.60 MB/sec), 412.3 ms avg latency, 464.0 ms max latency.
2026-01-07 03:46:28 24535 records sent, 4907.0 records/sec (47.92 MB/sec), 416.9 ms avg latency, 484.0 ms max latency.
2026-01-07 03:46:33 23815 records sent, 4763.0 records/sec (46.51 MB/sec), 419.0 ms avg latency, 693.0 ms max latency.
2026-01-07 03:46:38 24041 records sent, 4808.2 records/sec (46.96 MB/sec), 436.4 ms avg latency, 692.0 ms max latency.
2026-01-07 03:46:43 23654 records sent, 4730.8 records/sec (46.20 MB/sec), 433.9 ms avg latency, 519.0 ms max latency.
2026-01-07 03:46:48 22860 records sent, 4572.0 records/sec (44.65 MB/sec), 446.3 ms avg latency, 582.0 ms max latency.
2026-01-07 03:46:53 21515 records sent, 4303.0 records/sec (42.02 MB/sec), 477.5 ms avg latency, 757.0 ms max latency.
2026-01-07 03:46:58 21920 records sent, 4384.0 records/sec (42.81 MB/sec), 467.7 ms avg latency, 626.0 ms max latency.
2026-01-07 03:47:03 22899 records sent, 4579.8 records/sec (44.72 MB/sec), 446.7 ms avg latency, 540.0 ms max latency.
2026-01-07 03:47:08 17851 records sent, 3570.2 records/sec (34.87 MB/sec), 537.3 ms avg latency, 1030.0 ms max latency.
2026-01-07 03:47:13 21159 records sent, 4231.8 records/sec (41.33 MB/sec), 511.3 ms avg latency, 1004.0 ms max latency.
2026-01-07 03:47:18 19547 records sent, 3908.6 records/sec (38.17 MB/sec), 526.5 ms avg latency, 632.0 ms max latency.
2026-01-07 03:47:23 20304 records sent, 4060.8 records/sec (39.66 MB/sec), 502.3 ms avg latency, 677.0 ms max latency.
2026-01-07 03:47:28 22108 records sent, 4421.6 records/sec (43.18 MB/sec), 465.7 ms avg latency, 600.0 ms max latency.
2026-01-07 03:47:33 22064 records sent, 4412.8 records/sec (43.09 MB/sec), 455.4 ms avg latency, 628.0 ms max latency.
2026-01-07 03:47:38 18415 records sent, 3683.0 records/sec (35.97 MB/sec), 568.4 ms avg latency, 1103.0 ms max latency.
2026-01-07 03:47:43 22866 records sent, 4573.2 records/sec (44.66 MB/sec), 447.5 ms avg latency, 611.0 ms max latency.
2026-01-07 03:47:48 20410 records sent, 4082.0 records/sec (39.86 MB/sec), 503.3 ms avg latency, 789.0 ms max latency.
2026-01-07 03:47:53 23840 records sent, 4768.0 records/sec (46.56 MB/sec), 428.6 ms avg latency, 547.0 ms max latency.
2026-01-07 03:47:58 24299 records sent, 4859.8 records/sec (47.46 MB/sec), 421.9 ms avg latency, 513.0 ms max latency.
2026-01-07 03:48:03 25255 records sent, 5051.0 records/sec (49.33 MB/sec), 406.4 ms avg latency, 461.0 ms max latency.
2026-01-07 03:48:08 21659 records sent, 4331.8 records/sec (42.30 MB/sec), 471.3 ms avg latency, 691.0 ms max latency.
2026-01-07 03:48:13 25475 records sent, 5095.0 records/sec (49.76 MB/sec), 402.5 ms avg latency, 494.0 ms max latency.
2026-01-07 03:48:18 22963 records sent, 4592.6 records/sec (44.85 MB/sec), 447.1 ms avg latency, 682.0 ms max latency.
2026-01-07 03:48:23 25015 records sent, 5003.0 records/sec (48.86 MB/sec), 409.5 ms avg latency, 449.0 ms max latency.
2026-01-07 03:48:28 24013 records sent, 4802.6 records/sec (46.90 MB/sec), 425.8 ms avg latency, 524.0 ms max latency.
2026-01-07 03:48:33 24969 records sent, 4993.8 records/sec (48.77 MB/sec), 411.4 ms avg latency, 482.0 ms max latency.
2026-01-07 03:48:38 18969 records sent, 3793.8 records/sec (37.05 MB/sec), 538.1 ms avg latency, 791.0 ms max latency.
2026-01-07 03:48:43 24900 records sent, 4980.0 records/sec (48.63 MB/sec), 411.9 ms avg latency, 472.0 ms max latency.
2026-01-07 03:48:48 24729 records sent, 4945.8 records/sec (48.30 MB/sec), 415.0 ms avg latency, 476.0 ms max latency.
2026-01-07 03:48:53 24825 records sent, 4965.0 records/sec (48.49 MB/sec), 410.9 ms avg latency, 471.0 ms max latency.
2026-01-07 03:48:58 23091 records sent, 4618.2 records/sec (45.10 MB/sec), 444.1 ms avg latency, 658.0 ms max latency.
2026-01-07 03:49:03 25397 records sent, 5079.4 records/sec (49.60 MB/sec), 404.6 ms avg latency, 443.0 ms max latency.
2026-01-07 03:49:08 21338 records sent, 4267.6 records/sec (41.68 MB/sec), 477.5 ms avg latency, 690.0 ms max latency.
2026-01-07 03:49:13 24513 records sent, 4902.6 records/sec (47.88 MB/sec), 418.5 ms avg latency, 517.0 ms max latency.
2026-01-07 03:49:18 21262 records sent, 4252.4 records/sec (41.53 MB/sec), 478.7 ms avg latency, 804.0 ms max latency.
2026-01-07 03:49:23 21325 records sent, 4265.0 records/sec (41.65 MB/sec), 485.0 ms avg latency, 654.0 ms max latency.
2026-01-07 03:49:28 23649 records sent, 4729.8 records/sec (46.19 MB/sec), 432.8 ms avg latency, 620.0 ms max latency.
2026-01-07 03:49:33 25494 records sent, 5098.8 records/sec (49.79 MB/sec), 402.9 ms avg latency, 441.0 ms max latency.
2026-01-07 03:49:38 21867 records sent, 4373.4 records/sec (42.71 MB/sec), 467.6 ms avg latency, 694.0 ms max latency.
2026-01-07 03:49:43 25336 records sent, 5067.2 records/sec (49.48 MB/sec), 403.8 ms avg latency, 447.0 ms max latency.
2026-01-07 03:49:48 24204 records sent, 4840.8 records/sec (47.27 MB/sec), 419.6 ms avg latency, 520.0 ms max latency.
2026-01-07 03:49:53 24826 records sent, 4965.2 records/sec (48.49 MB/sec), 417.5 ms avg latency, 547.0 ms max latency.
2026-01-07 03:49:58 24101 records sent, 4820.2 records/sec (47.07 MB/sec), 422.6 ms avg latency, 500.0 ms max latency.
2026-01-07 03:50:03 24662 records sent, 4932.4 records/sec (48.17 MB/sec), 415.5 ms avg latency, 493.0 ms max latency.
2026-01-07 03:50:08 22636 records sent, 4527.2 records/sec (44.21 MB/sec), 441.0 ms avg latency, 684.0 ms max latency.
2026-01-07 03:50:13 24649 records sent, 4929.8 records/sec (48.14 MB/sec), 427.6 ms avg latency, 761.0 ms max latency.
2026-01-07 03:50:18 24810 records sent, 4962.0 records/sec (48.46 MB/sec), 413.0 ms avg latency, 509.0 ms max latency.
2026-01-07 03:50:23 23423 records sent, 4684.6 records/sec (45.75 MB/sec), 437.9 ms avg latency, 721.0 ms max latency.
2026-01-07 03:50:28 24717 records sent, 4943.4 records/sec (48.28 MB/sec), 414.1 ms avg latency, 475.0 ms max latency.
2026-01-07 03:50:33 24407 records sent, 4881.4 records/sec (47.67 MB/sec), 420.2 ms avg latency, 526.0 ms max latency.
2026-01-07 03:50:38 21814 records sent, 4362.8 records/sec (42.61 MB/sec), 458.3 ms avg latency, 704.0 ms max latency.
2026-01-07 03:50:43 22275 records sent, 4452.3 records/sec (43.48 MB/sec), 462.1 ms avg latency, 745.0 ms max latency.
2026-01-07 03:50:48 23226 records sent, 4645.2 records/sec (45.36 MB/sec), 448.7 ms avg latency, 568.0 ms max latency.
2026-01-07 03:50:53 24811 records sent, 4962.2 records/sec (48.46 MB/sec), 414.2 ms avg latency, 487.0 ms max latency.
2026-01-07 03:50:58 24714 records sent, 4942.8 records/sec (48.27 MB/sec), 414.5 ms avg latency, 486.0 ms max latency.
2026-01-07 03:51:03 23639 records sent, 4727.8 records/sec (46.17 MB/sec), 433.6 ms avg latency, 619.0 ms max latency.
2026-01-07 03:51:08 22451 records sent, 4490.2 records/sec (43.85 MB/sec), 451.7 ms avg latency, 637.0 ms max latency.
2026-01-07 03:51:13 22650 records sent, 4530.0 records/sec (44.24 MB/sec), 454.5 ms avg latency, 658.0 ms max latency.
2026-01-07 03:51:18 23158 records sent, 4631.6 records/sec (45.23 MB/sec), 444.3 ms avg latency, 581.0 ms max latency.
2026-01-07 03:51:23 24252 records sent, 4850.4 records/sec (47.37 MB/sec), 422.7 ms avg latency, 488.0 ms max latency.
2026-01-07 03:51:28 24378 records sent, 4875.6 records/sec (47.61 MB/sec), 418.6 ms avg latency, 474.0 ms max latency.
2026-01-07 03:51:33 25278 records sent, 5055.6 records/sec (49.37 MB/sec), 406.7 ms avg latency, 454.0 ms max latency.
2026-01-07 03:51:38 24564 records sent, 4912.8 records/sec (47.98 MB/sec), 416.8 ms avg latency, 512.0 ms max latency.
2026-01-07 03:51:43 22058 records sent, 4411.6 records/sec (43.08 MB/sec), 461.5 ms avg latency, 653.0 ms max latency.
2026-01-07 03:51:48 22452 records sent, 4490.4 records/sec (43.85 MB/sec), 446.5 ms avg latency, 591.0 ms max latency.
2026-01-07 03:51:53 24394 records sent, 4878.8 records/sec (47.64 MB/sec), 431.5 ms avg latency, 670.0 ms max latency.
2026-01-07 03:51:58 23399 records sent, 4679.8 records/sec (45.70 MB/sec), 436.4 ms avg latency, 583.0 ms max latency.
2026-01-07 03:52:03 23861 records sent, 4770.3 records/sec (46.58 MB/sec), 429.0 ms avg latency, 488.0 ms max latency.
2026-01-07 03:52:08 22056 records sent, 4409.4 records/sec (43.06 MB/sec), 462.4 ms avg latency, 724.0 ms max latency.
2026-01-07 03:52:13 23456 records sent, 4691.2 records/sec (45.81 MB/sec), 439.8 ms avg latency, 670.0 ms max latency.
2026-01-07 03:52:18 23981 records sent, 4795.2 records/sec (46.83 MB/sec), 425.0 ms avg latency, 526.0 ms max latency.
2026-01-07 03:52:23 22135 records sent, 4427.0 records/sec (43.23 MB/sec), 464.1 ms avg latency, 698.0 ms max latency.
2026-01-07 03:52:28 23355 records sent, 4671.0 records/sec (45.62 MB/sec), 439.8 ms avg latency, 550.0 ms max latency.
2026-01-07 03:52:33 24950 records sent, 4989.0 records/sec (48.72 MB/sec), 411.2 ms avg latency, 466.0 ms max latency.
2026-01-07 03:52:38 24563 records sent, 4912.6 records/sec (47.97 MB/sec), 418.2 ms avg latency, 504.0 ms max latency.
2026-01-07 03:52:43 23740 records sent, 4748.0 records/sec (46.37 MB/sec), 429.4 ms avg latency, 629.0 ms max latency.
2026-01-07 03:52:48 24527 records sent, 4905.4 records/sec (47.90 MB/sec), 419.0 ms avg latency, 520.0 ms max latency.
2026-01-07 03:52:53 24550 records sent, 4910.0 records/sec (47.95 MB/sec), 414.7 ms avg latency, 469.0 ms max latency.
2026-01-07 03:52:58 23715 records sent, 4743.0 records/sec (46.32 MB/sec), 434.1 ms avg latency, 547.0 ms max latency.
2026-01-07 03:53:03 24360 records sent, 4872.0 records/sec (47.58 MB/sec), 417.4 ms avg latency, 523.0 ms max latency.
2026-01-07 03:53:08 21076 records sent, 4215.2 records/sec (41.16 MB/sec), 488.8 ms avg latency, 715.0 ms max latency.
2026-01-07 03:53:13 23846 records sent, 4769.2 records/sec (46.57 MB/sec), 430.3 ms avg latency, 654.0 ms max latency.
2026-01-07 03:53:18 24218 records sent, 4843.6 records/sec (47.30 MB/sec), 423.1 ms avg latency, 497.0 ms max latency.
2026-01-07 03:53:23 24386 records sent, 4877.2 records/sec (47.63 MB/sec), 420.7 ms avg latency, 493.0 ms max latency.
2026-01-07 03:53:28 23480 records sent, 4696.0 records/sec (45.86 MB/sec), 434.9 ms avg latency, 524.0 ms max latency.
2026-01-07 03:53:33 24839 records sent, 4967.8 records/sec (48.51 MB/sec), 412.4 ms avg latency, 457.0 ms max latency.
2026-01-07 03:53:38 23950 records sent, 4790.0 records/sec (46.78 MB/sec), 428.9 ms avg latency, 536.0 ms max latency.
2026-01-07 03:53:43 23989 records sent, 4797.8 records/sec (46.85 MB/sec), 417.2 ms avg latency, 612.0 ms max latency.
2026-01-07 03:53:48 22064 records sent, 4412.8 records/sec (43.09 MB/sec), 472.5 ms avg latency, 671.0 ms max latency.
2026-01-07 03:53:53 24335 records sent, 4867.0 records/sec (47.53 MB/sec), 422.6 ms avg latency, 511.0 ms max latency.
2026-01-07 03:53:58 23368 records sent, 4673.6 records/sec (45.64 MB/sec), 438.7 ms avg latency, 542.0 ms max latency.
2026-01-07 03:54:03 23100 records sent, 4620.0 records/sec (45.12 MB/sec), 442.9 ms avg latency, 676.0 ms max latency.
2026-01-07 03:54:08 21263 records sent, 4252.6 records/sec (41.53 MB/sec), 478.6 ms avg latency, 810.0 ms max latency.
2026-01-07 03:54:13 24134 records sent, 4826.8 records/sec (47.14 MB/sec), 428.0 ms avg latency, 548.0 ms max latency.
2026-01-07 03:54:18 22733 records sent, 4546.6 records/sec (44.40 MB/sec), 450.1 ms avg latency, 764.0 ms max latency.
2026-01-07 03:54:23 23987 records sent, 4797.4 records/sec (46.85 MB/sec), 426.4 ms avg latency, 519.0 ms max latency.
2026-01-07 03:54:28 21748 records sent, 4349.6 records/sec (42.48 MB/sec), 472.1 ms avg latency, 781.0 ms max latency.
2026-01-07 03:54:33 24519 records sent, 4903.8 records/sec (47.89 MB/sec), 417.5 ms avg latency, 467.0 ms max latency.
2026-01-07 03:54:38 23339 records sent, 4667.8 records/sec (45.58 MB/sec), 437.7 ms avg latency, 521.0 ms max latency.
2026-01-07 03:54:43 24638 records sent, 4927.6 records/sec (48.12 MB/sec), 414.1 ms avg latency, 487.0 ms max latency.
2026-01-07 03:54:48 22641 records sent, 4528.2 records/sec (44.22 MB/sec), 455.1 ms avg latency, 696.0 ms max latency.
2026-01-07 03:54:53 25195 records sent, 5039.0 records/sec (49.21 MB/sec), 408.1 ms avg latency, 475.0 ms max latency.
2026-01-07 03:54:58 24322 records sent, 4864.4 records/sec (47.50 MB/sec), 420.9 ms avg latency, 504.0 ms max latency.
2026-01-07 03:55:03 25305 records sent, 5061.0 records/sec (49.42 MB/sec), 404.1 ms avg latency, 440.0 ms max latency.
2026-01-07 03:55:08 20897 records sent, 4179.4 records/sec (40.81 MB/sec), 483.8 ms avg latency, 773.0 ms max latency.
2026-01-07 03:55:13 24814 records sent, 4962.8 records/sec (48.46 MB/sec), 417.9 ms avg latency, 586.0 ms max latency.
2026-01-07 03:55:18 21510 records sent, 4301.1 records/sec (42.00 MB/sec), 474.7 ms avg latency, 779.0 ms max latency.
2026-01-07 03:55:23 24055 records sent, 4811.0 records/sec (46.98 MB/sec), 429.0 ms avg latency, 541.0 ms max latency.
2026-01-07 03:55:28 23328 records sent, 4665.6 records/sec (45.56 MB/sec), 438.7 ms avg latency, 576.0 ms max latency.
2026-01-07 03:55:33 25282 records sent, 5056.4 records/sec (49.38 MB/sec), 404.8 ms avg latency, 488.0 ms max latency.
2026-01-07 03:55:38 22109 records sent, 4421.8 records/sec (43.18 MB/sec), 459.8 ms avg latency, 835.0 ms max latency.
2026-01-07 03:55:43 22453 records sent, 4490.6 records/sec (43.85 MB/sec), 460.3 ms avg latency, 884.0 ms max latency.
2026-01-07 03:55:48 21283 records sent, 4256.6 records/sec (41.57 MB/sec), 480.7 ms avg latency, 792.0 ms max latency.
2026-01-07 03:55:53 22742 records sent, 4548.4 records/sec (44.42 MB/sec), 451.5 ms avg latency, 781.0 ms max latency.
2026-01-07 03:55:58 25105 records sent, 5021.0 records/sec (49.03 MB/sec), 407.6 ms avg latency, 469.0 ms max latency.
2026-01-07 03:56:03 25651 records sent, 5130.2 records/sec (50.10 MB/sec), 398.7 ms avg latency, 428.0 ms max latency.
2026-01-07 03:56:08 23263 records sent, 4652.6 records/sec (45.44 MB/sec), 438.0 ms avg latency, 636.0 ms max latency.
2026-01-07 03:56:13 25424 records sent, 5084.8 records/sec (49.66 MB/sec), 406.3 ms avg latency, 500.0 ms max latency.
2026-01-07 03:56:18 23649 records sent, 4729.8 records/sec (46.19 MB/sec), 431.6 ms avg latency, 642.0 ms max latency.
2026-01-07 03:56:23 25565 records sent, 5113.0 records/sec (49.93 MB/sec), 402.0 ms avg latency, 446.0 ms max latency.
2026-01-07 03:56:28 24474 records sent, 4894.8 records/sec (47.80 MB/sec), 417.2 ms avg latency, 510.0 ms max latency.
2026-01-07 03:56:33 24032 records sent, 4806.4 records/sec (46.94 MB/sec), 426.9 ms avg latency, 643.0 ms max latency.
2026-01-07 03:56:38 24957 records sent, 4991.4 records/sec (48.74 MB/sec), 410.9 ms avg latency, 482.0 ms max latency.
2026-01-07 03:56:43 25116 records sent, 5023.2 records/sec (49.05 MB/sec), 408.4 ms avg latency, 467.0 ms max latency.
2026-01-07 03:56:48 23350 records sent, 4670.0 records/sec (45.61 MB/sec), 436.5 ms avg latency, 658.0 ms max latency.
2026-01-07 03:56:53 25367 records sent, 5073.4 records/sec (49.54 MB/sec), 404.7 ms avg latency, 486.0 ms max latency.
2026-01-07 03:56:58 24864 records sent, 4972.8 records/sec (48.56 MB/sec), 413.3 ms avg latency, 471.0 ms max latency.
2026-01-07 03:57:03 25457 records sent, 5091.4 records/sec (49.72 MB/sec), 401.8 ms avg latency, 448.0 ms max latency.
2026-01-07 03:57:08 22987 records sent, 4597.4 records/sec (44.90 MB/sec), 441.6 ms avg latency, 678.0 ms max latency.
2026-01-07 03:57:13 24095 records sent, 4817.1 records/sec (47.04 MB/sec), 428.8 ms avg latency, 656.0 ms max latency.
2026-01-07 03:57:18 24272 records sent, 4854.4 records/sec (47.41 MB/sec), 416.6 ms avg latency, 473.0 ms max latency.
2026-01-07 03:57:23 23644 records sent, 4728.8 records/sec (46.18 MB/sec), 438.5 ms avg latency, 670.0 ms max latency.
2026-01-07 03:57:28 23692 records sent, 4738.4 records/sec (46.27 MB/sec), 433.4 ms avg latency, 525.0 ms max latency.
2026-01-07 03:57:33 24834 records sent, 4966.8 records/sec (48.50 MB/sec), 412.4 ms avg latency, 459.0 ms max latency.
2026-01-07 03:57:38 24239 records sent, 4847.8 records/sec (47.34 MB/sec), 422.4 ms avg latency, 504.0 ms max latency.
2026-01-07 03:57:43 25214 records sent, 5042.8 records/sec (49.25 MB/sec), 405.1 ms avg latency, 457.0 ms max latency.
2026-01-07 03:57:48 24595 records sent, 4919.0 records/sec (48.04 MB/sec), 418.3 ms avg latency, 472.0 ms max latency.
2026-01-07 03:57:53 22358 records sent, 4471.6 records/sec (43.67 MB/sec), 456.5 ms avg latency, 667.0 ms max latency.
2026-01-07 03:57:58 24783 records sent, 4956.6 records/sec (48.40 MB/sec), 413.4 ms avg latency, 485.0 ms max latency.
2026-01-07 03:58:03 25541 records sent, 5108.2 records/sec (49.88 MB/sec), 401.5 ms avg latency, 450.0 ms max latency.
2026-01-07 03:58:08 22827 records sent, 4565.4 records/sec (44.58 MB/sec), 448.3 ms avg latency, 666.0 ms max latency.
2026-01-07 03:58:13 25117 records sent, 5023.4 records/sec (49.06 MB/sec), 407.4 ms avg latency, 481.0 ms max latency.
2026-01-07 03:58:18 24743 records sent, 4948.6 records/sec (48.33 MB/sec), 415.6 ms avg latency, 479.0 ms max latency.
2026-01-07 03:58:23 23691 records sent, 4738.2 records/sec (46.27 MB/sec), 430.6 ms avg latency, 702.0 ms max latency.
2026-01-07 03:58:28 24522 records sent, 4904.4 records/sec (47.89 MB/sec), 419.1 ms avg latency, 493.0 ms max latency.
2026-01-07 03:58:33 25577 records sent, 5115.4 records/sec (49.96 MB/sec), 400.7 ms avg latency, 434.0 ms max latency.
2026-01-07 03:58:38 23088 records sent, 4617.6 records/sec (45.09 MB/sec), 444.5 ms avg latency, 656.0 ms max latency.
2026-01-07 03:58:43 25325 records sent, 5065.0 records/sec (49.46 MB/sec), 403.7 ms avg latency, 440.0 ms max latency.
2026-01-07 03:58:48 24251 records sent, 4850.2 records/sec (47.37 MB/sec), 423.1 ms avg latency, 515.0 ms max latency.
2026-01-07 03:58:53 24046 records sent, 4809.2 records/sec (46.96 MB/sec), 425.7 ms avg latency, 640.0 ms max latency.
2026-01-07 03:58:58 24527 records sent, 4904.4 records/sec (47.89 MB/sec), 417.2 ms avg latency, 489.0 ms max latency.
2026-01-07 03:59:03 24810 records sent, 4962.0 records/sec (48.46 MB/sec), 412.3 ms avg latency, 451.0 ms max latency.
2026-01-07 03:59:08 19319 records sent, 3863.8 records/sec (37.73 MB/sec), 517.0 ms avg latency, 902.0 ms max latency.
2026-01-07 03:59:13 23387 records sent, 4677.4 records/sec (45.68 MB/sec), 448.3 ms avg latency, 870.0 ms max latency.
2026-01-07 03:59:18 23127 records sent, 4625.4 records/sec (45.17 MB/sec), 445.2 ms avg latency, 635.0 ms max latency.
2026-01-07 03:59:23 22037 records sent, 4407.4 records/sec (43.04 MB/sec), 463.9 ms avg latency, 811.0 ms max latency.
2026-01-07 03:59:28 23581 records sent, 4716.2 records/sec (46.06 MB/sec), 433.4 ms avg latency, 515.0 ms max latency.
2026-01-07 03:59:33 24552 records sent, 4910.4 records/sec (47.95 MB/sec), 418.1 ms avg latency, 482.0 ms max latency.
2026-01-07 03:59:38 23316 records sent, 4663.2 records/sec (45.54 MB/sec), 438.7 ms avg latency, 527.0 ms max latency.
2026-01-07 03:59:43 24121 records sent, 4824.2 records/sec (47.11 MB/sec), 425.7 ms avg latency, 476.0 ms max latency.
2026-01-07 03:59:48 23814 records sent, 4762.8 records/sec (46.51 MB/sec), 430.1 ms avg latency, 516.0 ms max latency.
2026-01-07 03:59:53 23757 records sent, 4751.4 records/sec (46.40 MB/sec), 431.9 ms avg latency, 669.0 ms max latency.
2026-01-07 03:59:58 22989 records sent, 4597.8 records/sec (44.90 MB/sec), 445.3 ms avg latency, 659.0 ms max latency.
2026-01-07 04:00:03 25294 records sent, 5058.8 records/sec (49.40 MB/sec), 404.3 ms avg latency, 439.0 ms max latency.
2026-01-07 04:00:08 22974 records sent, 4594.8 records/sec (44.87 MB/sec), 444.3 ms avg latency, 630.0 ms max latency.
2026-01-07 04:00:13 25022 records sent, 5004.4 records/sec (48.87 MB/sec), 412.0 ms avg latency, 493.0 ms max latency.
2026-01-07 04:00:18 23577 records sent, 4715.4 records/sec (46.05 MB/sec), 433.3 ms avg latency, 537.0 ms max latency.
2026-01-07 04:00:23 23880 records sent, 4776.0 records/sec (46.64 MB/sec), 429.5 ms avg latency, 664.0 ms max latency.
2026-01-07 04:00:28 24033 records sent, 4806.6 records/sec (46.94 MB/sec), 426.7 ms avg latency, 483.0 ms max latency.
2026-01-07 04:00:33 25519 records sent, 5103.8 records/sec (49.84 MB/sec), 400.6 ms avg latency, 432.0 ms max latency.
2026-01-07 04:00:38 21689 records sent, 4337.8 records/sec (42.36 MB/sec), 472.0 ms avg latency, 793.0 ms max latency.
2026-01-07 04:00:43 23857 records sent, 4771.4 records/sec (46.60 MB/sec), 430.3 ms avg latency, 667.0 ms max latency.
2026-01-07 04:00:48 23217 records sent, 4643.4 records/sec (45.35 MB/sec), 439.0 ms avg latency, 693.0 ms max latency.
2026-01-07 04:00:53 24597 records sent, 4919.4 records/sec (48.04 MB/sec), 411.4 ms avg latency, 520.0 ms max latency.
2026-01-07 04:00:58 24397 records sent, 4879.4 records/sec (47.65 MB/sec), 426.6 ms avg latency, 630.0 ms max latency.
2026-01-07 04:01:03 25511 records sent, 5102.2 records/sec (49.83 MB/sec), 401.8 ms avg latency, 493.0 ms max latency.
2026-01-07 04:01:08 23464 records sent, 4692.8 records/sec (45.83 MB/sec), 433.1 ms avg latency, 629.0 ms max latency.
2026-01-07 04:01:13 25951 records sent, 5190.2 records/sec (50.69 MB/sec), 398.6 ms avg latency, 503.0 ms max latency.
2026-01-07 04:01:18 24748 records sent, 4949.6 records/sec (48.34 MB/sec), 413.7 ms avg latency, 495.0 ms max latency.
2026-01-07 04:01:23 23225 records sent, 4645.0 records/sec (45.36 MB/sec), 441.5 ms avg latency, 688.0 ms max latency.
2026-01-07 04:01:28 23200 records sent, 4640.0 records/sec (45.31 MB/sec), 441.5 ms avg latency, 735.0 ms max latency.
2026-01-07 04:01:33 25542 records sent, 5108.4 records/sec (49.89 MB/sec), 400.7 ms avg latency, 460.0 ms max latency.
2026-01-07 04:01:38 25149 records sent, 5029.8 records/sec (49.12 MB/sec), 408.3 ms avg latency, 485.0 ms max latency.
2026-01-07 04:01:43 25735 records sent, 5147.0 records/sec (50.26 MB/sec), 397.4 ms avg latency, 452.0 ms max latency.
2026-01-07 04:01:48 23915 records sent, 4783.0 records/sec (46.71 MB/sec), 428.1 ms avg latency, 592.0 ms max latency.
2026-01-07 04:01:53 25849 records sent, 5169.8 records/sec (50.49 MB/sec), 396.3 ms avg latency, 435.0 ms max latency.
2026-01-07 04:01:58 23739 records sent, 4747.8 records/sec (46.37 MB/sec), 432.1 ms avg latency, 637.0 ms max latency.
2026-01-07 04:02:03 24539 records sent, 4907.8 records/sec (47.93 MB/sec), 417.2 ms avg latency, 606.0 ms max latency.
2026-01-07 04:02:08 23185 records sent, 4637.0 records/sec (45.28 MB/sec), 438.3 ms avg latency, 669.0 ms max latency.
2026-01-07 04:02:13 25714 records sent, 5142.8 records/sec (50.22 MB/sec), 402.0 ms avg latency, 533.0 ms max latency.
2026-01-07 04:02:18 24956 records sent, 4990.2 records/sec (48.73 MB/sec), 409.9 ms avg latency, 489.0 ms max latency.
2026-01-07 04:02:23 25587 records sent, 5117.4 records/sec (49.97 MB/sec), 400.9 ms avg latency, 452.0 ms max latency.
2026-01-07 04:02:28 23612 records sent, 4722.4 records/sec (46.12 MB/sec), 433.7 ms avg latency, 660.0 ms max latency.
2026-01-07 04:02:33 25697 records sent, 5139.4 records/sec (50.19 MB/sec), 399.2 ms avg latency, 458.0 ms max latency.
2026-01-07 04:02:38 24852 records sent, 4970.4 records/sec (48.54 MB/sec), 411.1 ms avg latency, 494.0 ms max latency.
2026-01-07 04:02:43 24515 records sent, 4903.0 records/sec (47.88 MB/sec), 418.4 ms avg latency, 621.0 ms max latency.
2026-01-07 04:02:48 24230 records sent, 4846.0 records/sec (47.32 MB/sec), 422.7 ms avg latency, 505.0 ms max latency.
2026-01-07 04:02:53 25532 records sent, 5106.4 records/sec (49.87 MB/sec), 400.9 ms avg latency, 460.0 ms max latency.
2026-01-07 04:02:58 23976 records sent, 4795.2 records/sec (46.83 MB/sec), 427.8 ms avg latency, 641.0 ms max latency.
2026-01-07 04:03:03 25638 records sent, 5127.6 records/sec (50.07 MB/sec), 399.9 ms avg latency, 448.0 ms max latency.
2026-01-07 04:03:08 23101 records sent, 4620.2 records/sec (45.12 MB/sec), 440.8 ms avg latency, 652.0 ms max latency.
2026-01-07 04:03:13 25423 records sent, 5084.6 records/sec (49.65 MB/sec), 405.1 ms avg latency, 493.0 ms max latency.
2026-01-07 04:03:18 25004 records sent, 5000.8 records/sec (48.84 MB/sec), 409.3 ms avg latency, 480.0 ms max latency.
2026-01-07 04:03:23 23769 records sent, 4753.8 records/sec (46.42 MB/sec), 431.3 ms avg latency, 618.0 ms max latency.
2026-01-07 04:03:28 23933 records sent, 4786.6 records/sec (46.74 MB/sec), 428.4 ms avg latency, 672.0 ms max latency.
2026-01-07 04:03:33 25732 records sent, 5146.4 records/sec (50.26 MB/sec), 397.8 ms avg latency, 451.0 ms max latency.
2026-01-07 04:03:38 25551 records sent, 5110.2 records/sec (49.90 MB/sec), 401.3 ms avg latency, 452.0 ms max latency.
2026-01-07 04:03:43 25653 records sent, 5130.6 records/sec (50.10 MB/sec), 397.9 ms avg latency, 453.0 ms max latency.
2026-01-07 04:03:48 25114 records sent, 5022.8 records/sec (49.05 MB/sec), 409.6 ms avg latency, 474.0 ms max latency.
2026-01-07 04:03:53 25833 records sent, 5166.6 records/sec (50.46 MB/sec), 397.0 ms avg latency, 462.0 ms max latency.
2026-01-07 04:03:58 24092 records sent, 4818.4 records/sec (47.05 MB/sec), 424.6 ms avg latency, 590.0 ms max latency.
2026-01-07 04:04:03 25439 records sent, 5087.8 records/sec (49.69 MB/sec), 395.2 ms avg latency, 508.0 ms max latency.
2026-01-07 04:04:08 22713 records sent, 4542.6 records/sec (44.36 MB/sec), 456.9 ms avg latency, 687.0 ms max latency.
2026-01-07 04:04:13 26217 records sent, 5243.4 records/sec (51.21 MB/sec), 392.5 ms avg latency, 518.0 ms max latency.
2026-01-07 04:04:18 25044 records sent, 5008.8 records/sec (48.91 MB/sec), 409.6 ms avg latency, 497.0 ms max latency.
2026-01-07 04:04:23 25600 records sent, 5120.0 records/sec (50.00 MB/sec), 400.9 ms avg latency, 473.0 ms max latency.
2026-01-07 04:04:28 24376 records sent, 4875.2 records/sec (47.61 MB/sec), 408.9 ms avg latency, 539.0 ms max latency.
2026-01-07 04:04:33 25238 records sent, 5047.6 records/sec (49.29 MB/sec), 416.1 ms avg latency, 703.0 ms max latency.
2026-01-07 04:04:38 25015 records sent, 5003.0 records/sec (48.86 MB/sec), 409.9 ms avg latency, 479.0 ms max latency.
2026-01-07 04:04:43 25907 records sent, 5181.4 records/sec (50.60 MB/sec), 395.3 ms avg latency, 425.0 ms max latency.
2026-01-07 04:04:48 22124 records sent, 4424.8 records/sec (43.21 MB/sec), 461.5 ms avg latency, 718.0 ms max latency.
2026-01-07 04:04:53 25743 records sent, 5148.6 records/sec (50.28 MB/sec), 399.1 ms avg latency, 485.0 ms max latency.
2026-01-07 04:04:58 25013 records sent, 5002.6 records/sec (48.85 MB/sec), 409.7 ms avg latency, 470.0 ms max latency.
2026-01-07 04:05:03 24713 records sent, 4942.6 records/sec (48.27 MB/sec), 412.8 ms avg latency, 637.0 ms max latency.
2026-01-07 04:05:08 23682 records sent, 4736.4 records/sec (46.25 MB/sec), 430.5 ms avg latency, 656.0 ms max latency.
2026-01-07 04:05:13 25965 records sent, 5193.0 records/sec (50.71 MB/sec), 398.1 ms avg latency, 503.0 ms max latency.
2026-01-07 04:05:18 25067 records sent, 5013.4 records/sec (48.96 MB/sec), 407.0 ms avg latency, 462.0 ms max latency.
2026-01-07 04:05:23 25682 records sent, 5136.4 records/sec (50.16 MB/sec), 400.5 ms avg latency, 482.0 ms max latency.
2026-01-07 04:05:28 23673 records sent, 4734.6 records/sec (46.24 MB/sec), 433.0 ms avg latency, 679.0 ms max latency.
2026-01-07 04:05:33 24700 records sent, 4940.0 records/sec (48.24 MB/sec), 412.5 ms avg latency, 629.0 ms max latency.
2026-01-07 04:05:38 24241 records sent, 4848.2 records/sec (47.35 MB/sec), 415.4 ms avg latency, 563.0 ms max latency.
2026-01-07 04:05:43 24287 records sent, 4857.4 records/sec (47.44 MB/sec), 431.3 ms avg latency, 674.0 ms max latency.
2026-01-07 04:05:48 25072 records sent, 5014.4 records/sec (48.97 MB/sec), 407.1 ms avg latency, 463.0 ms max latency.
2026-01-07 04:05:53 26246 records sent, 5249.2 records/sec (51.26 MB/sec), 391.8 ms avg latency, 436.0 ms max latency.
2026-01-07 04:05:58 25256 records sent, 5051.2 records/sec (49.33 MB/sec), 405.3 ms avg latency, 464.0 ms max latency.
2026-01-07 04:06:03 24769 records sent, 4953.8 records/sec (48.38 MB/sec), 413.1 ms avg latency, 576.0 ms max latency.
2026-01-07 04:06:08 22148 records sent, 4429.6 records/sec (43.26 MB/sec), 458.7 ms avg latency, 679.0 ms max latency.
2026-01-07 04:06:13 25960 records sent, 5192.0 records/sec (50.70 MB/sec), 398.4 ms avg latency, 516.0 ms max latency.
2026-01-07 04:06:18 25189 records sent, 5037.8 records/sec (49.20 MB/sec), 406.5 ms avg latency, 463.0 ms max latency.
2026-01-07 04:06:23 26094 records sent, 5218.8 records/sec (50.96 MB/sec), 392.2 ms avg latency, 419.0 ms max latency.
2026-01-07 04:06:28 25335 records sent, 5067.0 records/sec (49.48 MB/sec), 404.8 ms avg latency, 462.0 ms max latency.
2026-01-07 04:06:33 24560 records sent, 4912.0 records/sec (47.97 MB/sec), 417.0 ms avg latency, 582.0 ms max latency.
2026-01-07 04:06:38 25378 records sent, 5075.6 records/sec (49.57 MB/sec), 403.8 ms avg latency, 462.0 ms max latency.
2026-01-07 04:06:43 25868 records sent, 5173.6 records/sec (50.52 MB/sec), 396.3 ms avg latency, 494.0 ms max latency.
2026-01-07 04:06:48 24080 records sent, 4816.0 records/sec (47.03 MB/sec), 415.6 ms avg latency, 599.0 ms max latency.
2026-01-07 04:06:53 25061 records sent, 5012.2 records/sec (48.95 MB/sec), 418.2 ms avg latency, 643.0 ms max latency.
2026-01-07 04:06:58 25557 records sent, 5111.4 records/sec (49.92 MB/sec), 401.0 ms avg latency, 486.0 ms max latency.
2026-01-07 04:07:03 24613 records sent, 4922.6 records/sec (48.07 MB/sec), 416.5 ms avg latency, 630.0 ms max latency.
2026-01-07 04:07:08 22599 records sent, 4519.8 records/sec (44.14 MB/sec), 425.7 ms avg latency, 940.0 ms max latency.
2026-01-07 04:07:13 20033 records sent, 4006.6 records/sec (39.13 MB/sec), 531.3 ms avg latency, 943.0 ms max latency.
2026-01-07 04:07:18 22878 records sent, 4575.6 records/sec (44.68 MB/sec), 456.3 ms avg latency, 892.0 ms max latency.
2026-01-07 04:07:23 25735 records sent, 5147.0 records/sec (50.26 MB/sec), 398.6 ms avg latency, 487.0 ms max latency.
2026-01-07 04:07:28 25261 records sent, 5052.2 records/sec (49.34 MB/sec), 405.7 ms avg latency, 461.0 ms max latency.
2026-01-07 04:07:33 22838 records sent, 4567.6 records/sec (44.61 MB/sec), 442.8 ms avg latency, 664.0 ms max latency.
2026-01-07 04:07:38 25120 records sent, 5024.0 records/sec (49.06 MB/sec), 411.1 ms avg latency, 556.0 ms max latency.
2026-01-07 04:07:43 26230 records sent, 5246.0 records/sec (51.23 MB/sec), 392.3 ms avg latency, 464.0 ms max latency.
2026-01-07 04:07:48 25571 records sent, 5114.2 records/sec (49.94 MB/sec), 400.2 ms avg latency, 471.0 ms max latency.
2026-01-07 04:07:53 25546 records sent, 5109.2 records/sec (49.89 MB/sec), 401.5 ms avg latency, 482.0 ms max latency.
2026-01-07 04:07:58 25338 records sent, 5067.6 records/sec (49.49 MB/sec), 404.1 ms avg latency, 464.0 ms max latency.
2026-01-07 04:08:03 25850 records sent, 5170.0 records/sec (50.49 MB/sec), 394.3 ms avg latency, 433.0 ms max latency.
2026-01-07 04:08:08 22288 records sent, 4457.6 records/sec (43.53 MB/sec), 458.4 ms avg latency, 681.0 ms max latency.
2026-01-07 04:08:13 24000 records sent, 4800.0 records/sec (46.88 MB/sec), 431.0 ms avg latency, 776.0 ms max latency.
2026-01-07 04:08:18 25417 records sent, 5083.4 records/sec (49.64 MB/sec), 402.2 ms avg latency, 462.0 ms max latency.
2026-01-07 04:08:23 25862 records sent, 5172.4 records/sec (50.51 MB/sec), 396.3 ms avg latency, 462.0 ms max latency.
2026-01-07 04:08:28 24906 records sent, 4981.2 records/sec (48.64 MB/sec), 411.4 ms avg latency, 478.0 ms max latency.
2026-01-07 04:08:33 25842 records sent, 5168.4 records/sec (50.47 MB/sec), 395.9 ms avg latency, 438.0 ms max latency.
2026-01-07 04:08:38 23567 records sent, 4713.4 records/sec (46.03 MB/sec), 435.1 ms avg latency, 753.0 ms max latency.
2026-01-07 04:08:43 25965 records sent, 5193.0 records/sec (50.71 MB/sec), 394.7 ms avg latency, 475.0 ms max latency.
2026-01-07 04:08:48 25374 records sent, 5074.8 records/sec (49.56 MB/sec), 402.6 ms avg latency, 461.0 ms max latency.
2026-01-07 04:08:53 24105 records sent, 4821.0 records/sec (47.08 MB/sec), 425.7 ms avg latency, 619.0 ms max latency.
2026-01-07 04:08:58 25067 records sent, 5013.4 records/sec (48.96 MB/sec), 408.9 ms avg latency, 470.0 ms max latency.
2026-01-07 04:09:03 26163 records sent, 5232.6 records/sec (51.10 MB/sec), 391.8 ms avg latency, 437.0 ms max latency.
2026-01-07 04:09:08 22136 records sent, 4427.2 records/sec (43.23 MB/sec), 461.8 ms avg latency, 695.0 ms max latency.
2026-01-07 04:09:13 25838 records sent, 5167.6 records/sec (50.46 MB/sec), 397.4 ms avg latency, 457.0 ms max latency.
2026-01-07 04:09:18 25181 records sent, 5036.2 records/sec (49.18 MB/sec), 406.9 ms avg latency, 486.0 ms max latency.
2026-01-07 04:09:23 25246 records sent, 5049.2 records/sec (49.31 MB/sec), 405.8 ms avg latency, 541.0 ms max latency.
2026-01-07 04:09:28 25048 records sent, 5009.6 records/sec (48.92 MB/sec), 408.9 ms avg latency, 486.0 ms max latency.
2026-01-07 04:09:33 24516 records sent, 4903.2 records/sec (47.88 MB/sec), 407.2 ms avg latency, 603.0 ms max latency.
2026-01-07 04:09:38 23236 records sent, 4647.2 records/sec (45.38 MB/sec), 452.4 ms avg latency, 688.0 ms max latency.
2026-01-07 04:09:43 25968 records sent, 5193.6 records/sec (50.72 MB/sec), 394.5 ms avg latency, 447.0 ms max latency.
2026-01-07 04:09:48 23720 records sent, 4744.0 records/sec (46.33 MB/sec), 430.7 ms avg latency, 559.0 ms max latency.
2026-01-07 04:09:53 25696 records sent, 5139.2 records/sec (50.19 MB/sec), 399.4 ms avg latency, 449.0 ms max latency.
2026-01-07 04:09:58 24790 records sent, 4958.0 records/sec (48.42 MB/sec), 413.8 ms avg latency, 482.0 ms max latency.
2026-01-07 04:10:03 25638 records sent, 5127.6 records/sec (50.07 MB/sec), 398.6 ms avg latency, 441.0 ms max latency.
2026-01-07 04:10:08 21855 records sent, 4371.0 records/sec (42.69 MB/sec), 463.8 ms avg latency, 752.0 ms max latency.
2026-01-07 04:10:13 25803 records sent, 5160.6 records/sec (50.40 MB/sec), 402.1 ms avg latency, 562.0 ms max latency.
2026-01-07 04:10:18 22320 records sent, 4464.0 records/sec (43.59 MB/sec), 458.3 ms avg latency, 731.0 ms max latency.
2026-01-07 04:10:23 25699 records sent, 5139.8 records/sec (50.19 MB/sec), 397.7 ms avg latency, 449.0 ms max latency.
2026-01-07 04:10:28 23483 records sent, 4696.6 records/sec (45.87 MB/sec), 437.0 ms avg latency, 576.0 ms max latency.
2026-01-07 04:10:33 25258 records sent, 5051.6 records/sec (49.33 MB/sec), 406.3 ms avg latency, 475.0 ms max latency.
2026-01-07 04:10:38 22909 records sent, 4581.8 records/sec (44.74 MB/sec), 444.9 ms avg latency, 669.0 ms max latency.
2026-01-07 04:10:43 22019 records sent, 4403.8 records/sec (43.01 MB/sec), 466.6 ms avg latency, 703.0 ms max latency.
2026-01-07 04:10:48 25019 records sent, 5003.8 records/sec (48.87 MB/sec), 410.2 ms avg latency, 485.0 ms max latency.
2026-01-07 04:10:53 25503 records sent, 5100.6 records/sec (49.81 MB/sec), 401.2 ms avg latency, 446.0 ms max latency.
2026-01-07 04:10:58 22929 records sent, 4585.8 records/sec (44.78 MB/sec), 447.5 ms avg latency, 757.0 ms max latency.
2026-01-07 04:11:03 25667 records sent, 5133.4 records/sec (50.13 MB/sec), 398.6 ms avg latency, 442.0 ms max latency.
2026-01-07 04:11:08 22864 records sent, 4572.8 records/sec (44.66 MB/sec), 431.7 ms avg latency, 702.0 ms max latency.
2026-01-07 04:11:13 23891 records sent, 4778.2 records/sec (46.66 MB/sec), 444.9 ms avg latency, 773.0 ms max latency.
2026-01-07 04:11:18 24719 records sent, 4943.8 records/sec (48.28 MB/sec), 413.5 ms avg latency, 476.0 ms max latency.
2026-01-07 04:11:23 25598 records sent, 5119.6 records/sec (50.00 MB/sec), 400.7 ms avg latency, 493.0 ms max latency.
2026-01-07 04:11:28 24554 records sent, 4910.8 records/sec (47.96 MB/sec), 417.5 ms avg latency, 494.0 ms max latency.
2026-01-07 04:11:33 25351 records sent, 5070.2 records/sec (49.51 MB/sec), 404.0 ms avg latency, 451.0 ms max latency.
2026-01-07 04:11:38 22921 records sent, 4584.2 records/sec (44.77 MB/sec), 446.6 ms avg latency, 726.0 ms max latency.
2026-01-07 04:11:43 23163 records sent, 4632.6 records/sec (45.24 MB/sec), 443.3 ms avg latency, 756.0 ms max latency.
2026-01-07 04:11:48 23821 records sent, 4764.2 records/sec (46.53 MB/sec), 429.2 ms avg latency, 538.0 ms max latency.
2026-01-07 04:11:53 25706 records sent, 5141.2 records/sec (50.21 MB/sec), 398.4 ms avg latency, 453.0 ms max latency.
2026-01-07 04:11:58 24944 records sent, 4988.8 records/sec (48.72 MB/sec), 410.5 ms avg latency, 500.0 ms max latency.
2026-01-07 04:12:03 25655 records sent, 5131.0 records/sec (50.11 MB/sec), 399.7 ms avg latency, 446.0 ms max latency.
2026-01-07 04:12:08 23238 records sent, 4647.6 records/sec (45.39 MB/sec), 429.4 ms avg latency, 761.0 ms max latency.
2026-01-07 04:12:13 24009 records sent, 4801.8 records/sec (46.89 MB/sec), 436.1 ms avg latency, 704.0 ms max latency.
2026-01-07 04:12:18 23956 records sent, 4791.2 records/sec (46.79 MB/sec), 419.4 ms avg latency, 602.0 ms max latency.
2026-01-07 04:12:23 24252 records sent, 4850.4 records/sec (47.37 MB/sec), 431.2 ms avg latency, 705.0 ms max latency.
2026-01-07 04:12:28 25213 records sent, 5042.6 records/sec (49.24 MB/sec), 407.1 ms avg latency, 484.0 ms max latency.
2026-01-07 04:12:33 25729 records sent, 5145.8 records/sec (50.25 MB/sec), 398.8 ms avg latency, 465.0 ms max latency.
2026-01-07 04:12:38 25315 records sent, 5063.0 records/sec (49.44 MB/sec), 404.8 ms avg latency, 459.0 ms max latency.
2026-01-07 04:12:43 21985 records sent, 4397.0 records/sec (42.94 MB/sec), 465.1 ms avg latency, 920.0 ms max latency.
2026-01-07 04:12:48 24061 records sent, 4812.2 records/sec (46.99 MB/sec), 426.8 ms avg latency, 564.0 ms max latency.
2026-01-07 04:12:53 25454 records sent, 5090.8 records/sec (49.71 MB/sec), 400.7 ms avg latency, 440.0 ms max latency.
2026-01-07 04:12:58 24956 records sent, 4991.2 records/sec (48.74 MB/sec), 412.2 ms avg latency, 489.0 ms max latency.
2026-01-07 04:13:03 24293 records sent, 4858.6 records/sec (47.45 MB/sec), 421.4 ms avg latency, 647.0 ms max latency.
2026-01-07 04:13:08 23660 records sent, 4732.0 records/sec (46.21 MB/sec), 426.0 ms avg latency, 660.0 ms max latency.
2026-01-07 04:13:13 24047 records sent, 4809.4 records/sec (46.97 MB/sec), 432.9 ms avg latency, 705.0 ms max latency.
2026-01-07 04:13:18 25103 records sent, 5020.6 records/sec (49.03 MB/sec), 408.5 ms avg latency, 493.0 ms max latency.
2026-01-07 04:13:23 24216 records sent, 4843.2 records/sec (47.30 MB/sec), 422.3 ms avg latency, 684.0 ms max latency.
2026-01-07 04:13:28 24258 records sent, 4851.6 records/sec (47.38 MB/sec), 421.0 ms avg latency, 493.0 ms max latency.
2026-01-07 04:13:33 24173 records sent, 4834.6 records/sec (47.21 MB/sec), 423.0 ms avg latency, 513.0 ms max latency.
2026-01-07 04:13:38 24821 records sent, 4964.2 records/sec (48.48 MB/sec), 415.1 ms avg latency, 485.0 ms max latency.
2026-01-07 04:13:43 22927 records sent, 4585.4 records/sec (44.78 MB/sec), 446.4 ms avg latency, 640.0 ms max latency.
2026-01-07 04:13:48 24396 records sent, 4879.2 records/sec (47.65 MB/sec), 420.2 ms avg latency, 554.0 ms max latency.
2026-01-07 04:13:53 25736 records sent, 5147.2 records/sec (50.27 MB/sec), 398.2 ms avg latency, 453.0 ms max latency.
2026-01-07 04:13:58 24609 records sent, 4921.8 records/sec (48.06 MB/sec), 413.6 ms avg latency, 497.0 ms max latency.
2026-01-07 04:14:03 24908 records sent, 4981.6 records/sec (48.65 MB/sec), 414.4 ms avg latency, 479.0 ms max latency.
2026-01-07 04:14:08 23006 records sent, 4601.2 records/sec (44.93 MB/sec), 437.7 ms avg latency, 613.0 ms max latency.
2026-01-07 04:14:13 24066 records sent, 4813.2 records/sec (47.00 MB/sec), 421.5 ms avg latency, 583.0 ms max latency.
2026-01-07 04:14:18 23519 records sent, 4703.8 records/sec (45.94 MB/sec), 445.7 ms avg latency, 684.0 ms max latency.
2026-01-07 04:14:23 22721 records sent, 4544.2 records/sec (44.38 MB/sec), 451.1 ms avg latency, 765.0 ms max latency.
2026-01-07 04:14:28 25057 records sent, 5011.4 records/sec (48.94 MB/sec), 408.9 ms avg latency, 484.0 ms max latency.
2026-01-07 04:14:33 25705 records sent, 5141.0 records/sec (50.21 MB/sec), 399.6 ms avg latency, 472.0 ms max latency.
2026-01-07 04:14:38 24655 records sent, 4931.0 records/sec (48.15 MB/sec), 414.7 ms avg latency, 525.0 ms max latency.
2026-01-07 04:14:43 25396 records sent, 5079.2 records/sec (49.60 MB/sec), 402.1 ms avg latency, 472.0 ms max latency.
2026-01-07 04:14:48 22642 records sent, 4528.4 records/sec (44.22 MB/sec), 454.0 ms avg latency, 628.0 ms max latency.
2026-01-07 04:14:53 24024 records sent, 4804.8 records/sec (46.92 MB/sec), 426.8 ms avg latency, 496.0 ms max latency.
2026-01-07 04:14:58 24987 records sent, 4997.4 records/sec (48.80 MB/sec), 408.6 ms avg latency, 456.0 ms max latency.
2026-01-07 04:15:03 24845 records sent, 4969.0 records/sec (48.53 MB/sec), 406.1 ms avg latency, 572.0 ms max latency.
2026-01-07 04:15:08 23290 records sent, 4658.0 records/sec (45.49 MB/sec), 442.2 ms avg latency, 674.0 ms max latency.
2026-01-07 04:15:13 25650 records sent, 5130.0 records/sec (50.10 MB/sec), 403.5 ms avg latency, 563.0 ms max latency.
2026-01-07 04:15:18 23281 records sent, 4656.2 records/sec (45.47 MB/sec), 440.6 ms avg latency, 704.0 ms max latency.
2026-01-07 04:15:23 25713 records sent, 5142.6 records/sec (50.22 MB/sec), 399.0 ms avg latency, 445.0 ms max latency.
2026-01-07 04:15:28 24918 records sent, 4983.6 records/sec (48.67 MB/sec), 408.6 ms avg latency, 487.0 ms max latency.
2026-01-07 04:15:33 25747 records sent, 5149.4 records/sec (50.29 MB/sec), 400.7 ms avg latency, 460.0 ms max latency.
2026-01-07 04:15:38 24632 records sent, 4926.4 records/sec (48.11 MB/sec), 414.7 ms avg latency, 499.0 ms max latency.
2026-01-07 04:15:42 10000000 records sent, 4794.3 records/sec (46.82 MB/sec), 427.21 ms avg latency, 6105.00 ms max latency, 409 ms 50th, 540 ms 95th, 674 ms 99th, 904 ms 99.9th.